Revit 2027 API
TextNode Class
 This class represents a text annotation object in a model-exporting process.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.TextNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class TextNode : RenderNode
Public Class TextNode
	Inherits RenderNode
public ref class TextNode : public RenderNode
type TextNode =
    class
        inherit RenderNode
    end
The TextNode type exposes the following members.
Properties
Name | Description
BaseDirection |  Direction of the base line of the text object in model space.
Color |  The color of the text.
FontHeight |  Height [ft] of the text font, in model space.
FontName |  The name of the text font.
Height |  Height [ft] of the area of the text content in model space.
HorizontalAlignment |  Indicates default horizontal alignment of the text.
IsBold |  Indicates whether the default formatting is set to bold text.
IsItalic |  Indicates whether the default formatting is set to italic text.
IsKeptReadable |  Indicates text behavior inside a rotated text object.
IsTransparent |  Indicates whether the text background is transparent or opaque.
IsUnderlined |  Indicates whether the default formatting is set to underlined text.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Position |  Position of the text in model coordinates.
TabSize |  The size [ft] of the interval between tab stops, in model space.
Text |  The content of the text annotation as a plain string stripped of all formatting.
UpDirection |  Direction along the vertical axis of letters of the text object in model space.
VerticalAlignment |  Indicates default vertical alignment of the text.
Width |  Width [ft] of the area of the text content in model space.
WidthScale |  Scale applied to the width of the text.
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFormattedText |  Returns an FormattedText object that contains text and associated formatting of this TextNode.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: OnText(TextNode).
See Also
Reference
Autodesk.Revit.DB Namespace